HirokiIshiguro/rx-driver-package/source/r_rsci_iic_rx/r_rsci_iic_rx_vx.xx/r_rsci_iic_rx/src/targets/rx261/r_rsci_iic_rx261.c
/***********************************************************************************************************************
* Copyright (c) 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_rsci_iic_rx261.c
 * Description  : Functions for using RSCI_IIC on RX devices. 
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 30.10.2025 1.00     First Release
 **********************************************************************************************************************/
/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
/* Access to peripherals and board defines. */
#include "platform.h"

#ifdef BSP_MCU_RX261
/* Defines for RSCI_IIC support */
    #include "r_rsci_iic_rx_pin_config.h"
    #include "r_rsci_iic_rx_private.h"
    #include "r_rsci_iic_rx261_private.h"
    #include "r_rsci_iic_rx_if.h"
    #include "r_rsci_iic_rx_config.h"

/***********************************************************************************************************************
 Exported global variables (to be accessed by other files)
 **********************************************************************************************************************/
/*----------------------------------------------------------------------------*/
/*   Defines specific information for each RSCI IIC channel.                   */
/*----------------------------------------------------------------------------*/
    #if RSCI_IIC_CFG_CH0_INCLUDED
/* rom info */
const rsci_iic_ch_rom_t g_rsci_iic_ch0_rom =
{
    BSP_LOCK_RSCI0,
    (rsci_regs_t)&RSCI0, /* Cast to rsci_regs_t */
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRB.LONG, BIT31_MASK, /* Cast to R_BSP_EVENACCESS_SFR */
    &ICU.IPR[IPR_RSCI0_TXI].BYTE,
    &ICU.IR[IR_RSCI0_TXI].BYTE,
    &ICU.IR[IR_RSCI0_TEI].BYTE, BIT0_MASK,
    &ICU.IER[IER_RSCI0_TXI].BYTE, BIT0_MASK,
    &ICU.IER[IER_RSCI0_TEI].BYTE, BIT1_MASK,
    RSCI_IIC_CFG_CH0_INT_PRIORITY,
    RSCI_IIC_CH0_SSCL_GP,
    RSCI_IIC_CH0_SSCL_PIN,
    RSCI_IIC_MPC_SSCL000_ENABLE,
    RSCI_IIC_CH0_SSDA_GP,
    RSCI_IIC_CH0_SSDA_PIN,
    RSCI_IIC_MPC_SSDA000_ENABLE,
    RSCI_IIC_CFG_CH0_SSDA_DELAY_SELECT,
    RSCI_IIC_CFG_CH0_BITRATE_BPS,
    RSCI_IIC_CFG_CH0_DIGITAL_FILTER,
    RSCI_IIC_CFG_CH0_FILTER_CLOCK
};

/* channel control block */
rsci_iic_ch_ctrl_t g_rsci_iic_ch0_ctrl =
{
    &g_rsci_iic_ch0_rom,
    RSCI_IIC_EV_INIT,
    RSCI_IIC_MODE_NONE,
    RSCI_IIC_STS_NO_INIT,
    RSCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO, /* Cast to uint8_t */
    (rsci_iic_info_t *)NULL
};
    #endif /* RSCI_IIC_CFG_CH0_INCLUDED */

    #if RSCI_IIC_CFG_CH8_INCLUDED
/* rom info */
const rsci_iic_ch_rom_t g_rsci_iic_ch8_rom =
{
    BSP_LOCK_RSCI8,
    (rsci_regs_t)&RSCI8, /* Cast to rsci_regs_t */
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRC.LONG, BIT27_MASK, /* Cast to R_BSP_EVENACCESS_SFR */
    &ICU.IPR[IPR_RSCI8_TXI].BYTE,
    &ICU.IR[IR_RSCI8_TXI].BYTE,
    &ICU.IR[IR_RSCI8_TEI].BYTE, BIT0_MASK,
    &ICU.IER[IER_RSCI8_TXI].BYTE, BIT0_MASK,
    &ICU.IER[IER_RSCI8_TEI].BYTE, BIT1_MASK,
    RSCI_IIC_CFG_CH8_INT_PRIORITY,
    RSCI_IIC_CH8_SSCL_GP,
    RSCI_IIC_CH8_SSCL_PIN,
    RSCI_IIC_MPC_SSCL008_ENABLE,
    RSCI_IIC_CH8_SSDA_GP,
    RSCI_IIC_CH8_SSDA_PIN,
    RSCI_IIC_MPC_SSDA008_ENABLE,
    RSCI_IIC_CFG_CH8_SSDA_DELAY_SELECT,
    RSCI_IIC_CFG_CH8_BITRATE_BPS,
    RSCI_IIC_CFG_CH8_DIGITAL_FILTER,
    RSCI_IIC_CFG_CH8_FILTER_CLOCK
};

/* channel control block */
rsci_iic_ch_ctrl_t g_rsci_iic_ch8_ctrl =
{
    &g_rsci_iic_ch8_rom,
    RSCI_IIC_EV_INIT,
    RSCI_IIC_MODE_NONE,
    RSCI_IIC_STS_NO_INIT,
    RSCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO, /* Cast to uint8_t */
    (rsci_iic_info_t *)NULL
};
    #endif /* RSCI_IIC_CFG_CH8_INCLUDED */

    #if RSCI_IIC_CFG_CH9_INCLUDED
/* rom info */
const rsci_iic_ch_rom_t g_rsci_iic_ch9_rom =
{
    BSP_LOCK_RSCI9,
    (rsci_regs_t)&RSCI9, /* Cast to rsci_regs_t */
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRC.LONG, BIT26_MASK, /* Cast to R_BSP_EVENACCESS_SFR */
    &ICU.IPR[IPR_RSCI9_TXI].BYTE,
    &ICU.IR[IR_RSCI9_TXI].BYTE,
    &ICU.IR[IR_RSCI9_TEI].BYTE, BIT0_MASK,
    &ICU.IER[IER_RSCI9_TXI].BYTE, BIT4_MASK,
    &ICU.IER[IER_RSCI9_TEI].BYTE, BIT5_MASK,
    RSCI_IIC_CFG_CH9_INT_PRIORITY,
    RSCI_IIC_CH9_SSCL_GP,
    RSCI_IIC_CH9_SSCL_PIN,
    RSCI_IIC_MPC_SSCL009_ENABLE,
    RSCI_IIC_CH9_SSDA_GP,
    RSCI_IIC_CH9_SSDA_PIN,
    RSCI_IIC_MPC_SSDA009_ENABLE,
    RSCI_IIC_CFG_CH9_SSDA_DELAY_SELECT,
    RSCI_IIC_CFG_CH9_BITRATE_BPS,
    RSCI_IIC_CFG_CH9_DIGITAL_FILTER,
    RSCI_IIC_CFG_CH9_FILTER_CLOCK
};

/* channel control block */
rsci_iic_ch_ctrl_t g_rsci_iic_ch9_ctrl =
{
    &g_rsci_iic_ch9_rom,
    RSCI_IIC_EV_INIT,
    RSCI_IIC_MODE_NONE,
    RSCI_IIC_STS_NO_INIT,
    RSCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO, /* Cast to uint8_t */
    (rsci_iic_info_t *)NULL
};
    #endif /* RSCI_IIC_CFG_CH9_INCLUDED */

/*----------------------------------------------------------------------------*/
/*   Array for start addresses of information for each RSCI IIC channel        */
/*----------------------------------------------------------------------------*/
const rsci_iic_hdl_t g_rsci_iic_handles[RSCI_IIC_NUM_CH_MAX] =
{
    #if RSCI_IIC_CFG_CH0_INCLUDED
    &g_rsci_iic_ch0_ctrl,
    #else
    NULL,
    #endif
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    #if RSCI_IIC_CFG_CH8_INCLUDED
    &g_rsci_iic_ch8_ctrl,
    #else
    NULL,
    #endif
    #if RSCI_IIC_CFG_CH9_INCLUDED
    &g_rsci_iic_ch9_ctrl,
    #else
    NULL,
    #endif
    NULL,
    NULL,
    NULL
};

