HirokiIshiguro/rx-driver-package/source/r_rsci_iic_rx/r_rsci_iic_rx_vx.xx/r_rsci_iic_rx/src/targets/rx261/r_rsci_iic_rx261.c
/***********************************************************************************************************************
 * Function Name: rsci_iic_clear_ir_flag
 * Description  : Clears Interrupt Request Flag Processing.
 *                Clears interrupt request register.
 * Arguments    : rsci_iic_info_t * p_rsci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void rsci_iic_clear_ir_flag(rsci_iic_info_t * p_rsci_iic_info)
{
    rsci_regs_t pregs = g_rsci_iic_handles[p_rsci_iic_info->ch_no]->prom->regs;

    R_BSP_VOLATILE_EVENACCESS const rsci_iic_ch_rom_t * p_rom = g_rsci_iic_handles[p_rsci_iic_info->ch_no]->prom;

    /* Checks IR flag. */
    /* If IR flag is set, clears IR flag. */

    if (RSCI_IIC_IR_SET == (*p_rom->pir_txi))
    {
        /* Initializes ICIER->SCR0 register. */
        pregs->SCR0.LONG = RSCI_IIC_SCR0_INIT;

        /* WAIT_LOOP */
        while (RSCI_IIC_SCR0_INIT != pregs->SCR0.LONG)
        {
            /* nothing to do */
            R_BSP_NOP();
        }

        /* Clears TXI interrupt request register. */
        (*p_rom->pir_txi) = RSCI_IIC_IR_CLR;

        /* dummy read */
        if (*p_rom->pir_txi)
        {
            R_BSP_NOP();
        }
    }
} /* End of function rsci_iic_clear_ir_flag() */

    #if RSCI_IIC_CFG_CH0_INCLUDED
/***********************************************************************************************************************
 * Function Name: rsci_iic_int_rsci_iic0_txi_isr
 * Description  : Interrupt TXI handler for channel 0.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT (rsci_iic_int_rsci_iic0_txi_isr, VECT_RSCI0_TXI)
R_BSP_ATTRIB_STATIC_INTERRUPT void rsci_iic_int_rsci_iic0_txi_isr(void)
{
    r_rsci_iic_txi_isr_processing(RSCI_IIC_NUM_CH0);

    /* Calls advance function */
    r_rsci_iic_advance(g_rsci_iic_handles[RSCI_IIC_NUM_CH0]->prsci_iic_info_ch);
} /* End of function rsci_iic_int_rsci_iic0_txi_isr() */
    #endif

    #if RSCI_IIC_CFG_CH8_INCLUDED
/***********************************************************************************************************************
 * Function Name: rsci_iic_int_rsci_iic8_txi_isr
 * Description  : Interrupt TXI handler for channel 8.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT (rsci_iic_int_rsci_iic8_txi_isr, VECT_RSCI8_TXI)
R_BSP_ATTRIB_STATIC_INTERRUPT void rsci_iic_int_rsci_iic8_txi_isr(void)
{
    r_rsci_iic_txi_isr_processing(RSCI_IIC_NUM_CH8);

    /* Calls advance function */
    r_rsci_iic_advance(g_rsci_iic_handles[RSCI_IIC_NUM_CH8]->prsci_iic_info_ch);
} /* End of function rsci_iic_int_rsci_iic8_txi_isr() */
    #endif

    #if RSCI_IIC_CFG_CH9_INCLUDED
/***********************************************************************************************************************
 * Function Name: rsci_iic_int_rsci_iic9_txi_isr
 * Description  : Interrupt TXI handler for channel 9.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT (rsci_iic_int_rsci_iic9_txi_isr, VECT_RSCI9_TXI)
R_BSP_ATTRIB_STATIC_INTERRUPT void rsci_iic_int_rsci_iic9_txi_isr(void)
{
    r_rsci_iic_txi_isr_processing(RSCI_IIC_NUM_CH9);

    /* Calls advance function */
    r_rsci_iic_advance(g_rsci_iic_handles[RSCI_IIC_NUM_CH9]->prsci_iic_info_ch);
} /* End of function rsci_iic_int_rsci_iic9_txi_isr() */
    #endif

    #if RSCI_IIC_CFG_CH0_INCLUDED
/***********************************************************************************************************************
 * Function Name: rsci_iic_int_rsci_iic0_tei_isr
 * Description  : Interrupt TEI handler for channel 0.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT (rsci_iic_int_rsci_iic0_tei_isr, VECT_RSCI0_TEI)
R_BSP_ATTRIB_STATIC_INTERRUPT void rsci_iic_int_rsci_iic0_tei_isr(void)
{
    r_rsci_iic_tei_isr_processing(RSCI_IIC_NUM_CH0);

    /* Calls advance function */
    r_rsci_iic_advance(g_rsci_iic_handles[RSCI_IIC_NUM_CH0]->prsci_iic_info_ch);
} /* End of function rsci_iic_int_rsci_iic0_tei_isr() */
    #endif

    #if RSCI_IIC_CFG_CH8_INCLUDED
/***********************************************************************************************************************
 * Function Name: rsci_iic_int_rsci_iic8_tei_isr
 * Description  : Interrupt TEI handler for channel 8.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT (rsci_iic_int_rsci_iic8_tei_isr, VECT_RSCI8_TEI)
R_BSP_ATTRIB_STATIC_INTERRUPT void rsci_iic_int_rsci_iic8_tei_isr(void)
{
    r_rsci_iic_tei_isr_processing(RSCI_IIC_NUM_CH8);

    /* Calls advance function */
    r_rsci_iic_advance(g_rsci_iic_handles[RSCI_IIC_NUM_CH8]->prsci_iic_info_ch);
} /* End of function rsci_iic_int_rsci_iic8_tei_isr() */
    #endif

    #if RSCI_IIC_CFG_CH9_INCLUDED
/***********************************************************************************************************************
 * Function Name: rsci_iic_int_rsci_iic9_tei_isr
 * Description  : Interrupt TEI handler for channel 9.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT (rsci_iic_int_rsci_iic9_tei_isr, VECT_RSCI9_TEI)
R_BSP_ATTRIB_STATIC_INTERRUPT void rsci_iic_int_rsci_iic9_tei_isr(void)
{
    r_rsci_iic_tei_isr_processing(RSCI_IIC_NUM_CH9);

    /* Calls advance function */
    r_rsci_iic_advance(g_rsci_iic_handles[RSCI_IIC_NUM_CH9]->prsci_iic_info_ch);
} /* End of function rsci_iic_int_rsci_iic9_tei_isr() */
    #endif

#endif /* BSP_MCU_RX261 */

